package lesson1_2.levelA.a3;

/*
В классе Run создайте константу, которая будет хранить в себе номер месяца вашего рождения.
 Выведите значение константы в консоль.
 */
public class Run {
    private static final byte MOUNTH = 8;

    public static void main(String[] args) {
        System.out.println(MOUNTH);
    }
}
