package lesson2_1.levelA.a3;

/*
Создать две переменные типа int и проинициализировать их значениями 7 и 5.
 Выведите в консоль остаток от деления первого числа на второе.
 */
public class Run {
    public static void main(String[] args) {
        int varFirst = 7;
        int varSecond = 5;
        System.out.println(varFirst % varSecond);
    }
}
